{
    "products": [
      {
        "id": 1,
        "name": "베어본",
        "description": "베어본은 키보드를 구성하는 중요한 부품 중 하나입니다. 기본적으로 키보드 케이스나 프레임을 가리키는 용어입니다.\n\n베어본은 다양한 재료로 제작될 수 있습니다. 일반적으로는 알루미늄, 플라스틱 등이 사용됩니다. 각 재료마다 특징과 장단점이 있습니다.\n\n알루미늄 베어본은 견고하고 내구성이 뛰어나며 고급스러운 느낌을 줍니다. 하지만 무게가 상대적으로 무겁고 비용이 높을 수 있습니다.\n\n반면에 플라스틱 베어본은 가벼우며 다양한 색상과 디자인을 제공하여 선택의 폭을 넓혀줍니다. 또한 비용이 저렴하고 가볍기 때문에 휴대성이 좋습니다.\n\n베어본의 재료 선택은 개인의 취향과 사용 목적에 따라 다를 수 있습니다. 따라서 자신에게 가장 적합한 베어본을 선택하는 것이 중요합니다.",
        "description2": [
          "베어본을 구매할 때 고려해야 할 중요한 요소들은 다음과 같습니다:",
          "1. 재료: 베어본은 주로 알루미늄 또는 플라스틱으로 제작됩니다. 각 재료의 장단점을 고려하여 구매할 때 어떤 재료를 선택할지 결정해야 합니다. 알루미늄은 견고하고 내구성이 뛰어나지만 무게가 무거울 수 있고 비용이 높을 수 있습니다. 플라스틱은 가벼우며 색상과 디자인이 다양하지만 내구성이 약할 수 있습니다.","\n\n",
          "2. 호환성: 베어본이 사용될 키보드의 호환성을 확인해야 합니다. 일부 베어본은 특정 키보드 모델에만 호환되므로 구매 전에 호환성을 반드시 확인해야 합니다.",
          "3. 디자인 및 스타일: 베어본의 디자인과 스타일은 개인의 취향에 따라 다릅니다. 사용자가 원하는 디자인과 색상을 고려하여 선택해야 합니다.",
          "4. 가격: 가격은 항상 고려해야 하는 요소입니다. 예산에 맞는 가격대 내에서 고품질의 베어본을 선택하는 것이 중요합니다.",
          "5. 후속 서비스 및 보증: 제품을 구매한 후에도 제조사의 후속 서비스 및 보증 정책을 확인해야 합니다. 제품에 문제가 발생할 경우 신속하고 효과적인 지원을 받을 수 있는지 확인해야 합니다."
      ],
        "image": "../img/1barebones.jpg"
      },
      {
        "id": 2,
        "name": "스위치",
        "description": [
        "키보드 스위치는 키보드의 각 키를 누를 때 발생하는 신호를 생성하는 장치입니다. ",
        "이러한 스위치들은 주로 두 가지 유형으로 나뉩니다. 첫 번째는 메커니컬 스위치로, 이는 키를 누를 때 메탈 또는 플라스틱 부품들이 상호 작용함으로써 신호를 생성합니다.",
         "이들은 키를 누르는 동안 특정한 '클릭'감을 주어 타이핑 경험을 향상시킵니다. ",
        "두 번째는 멤브레인 스위치로, 이는 키를 누를 때 플라스틱 막이나 고무 부품들이 압력에 의해 접촉하여 신호를 생성합니다.",
        "멤브레인 스위치는 보다 조용하고 저렴하며 유지보수가 적은 특징을 가지고 있습니다.",
        "키보드 사용자는 스위치의 유형을 선택함으로써 자신의 선호도와 사용 목적에 맞는 키보드를 선택할 수 있습니다."],
        "description2": [
          "스위치를 구매할 때 고려해야 할 중요한 요소들은 다음과 같습니다:",
          "1. 사용 목적: 키보드를 어떤 활동에 사용할지 고려해야 합니다. 게임이나 타이핑과 같은 다양한 활동에 맞는 스위치를 선택해야 합니다.",
          "2. 소음 수준: 작업 환경이나 주변 사람들에게 영향을 미칠 수 있는 소음을 고려해야 합니다. 소음이 적은 스위치를 선호하는 경우에는 적절한 옵션을 선택해야 합니다.",
          "3. 타이핑 경험: 키를 누르는 감각이나 감촉에 대한 개인적인 선호도를 고려해야 합니다. 클릭감이나 키의 반발력 등을 고려하여 타이핑 경험을 개선할 수 있는 스위치를 선택해야 합니다.",
          "4. 내구성과 수명: 스위치의 내구성과 수명은 사용자 경험에 직접적으로 영향을 미칩니다. 오랜 시간 사용해도 성능이 변하지 않는 스위치를 선택하는 것이 중요합니다.",
          "5. 가격 대비 성능: 가격 대비 성능을 고려하여 적절한 스위치를 선택해야 합니다. 고품질의 스위치를 합리적인 가격에 구매할 수 있는지를 검토해야 합니다."
        ],
        "image": "../img/2switch.jpg"
      },
      {
        "id": 3,
        "name": "키캡",
        "description": [
          "키보드 키캡은 각 키 위에 덮여 있는 부분으로, 사용자가 키를 누를 때 눈에 보이는 부분입니다.",
          "키캡은 다양한 모양, 크기, 색상, 재질 등으로 제공됩니다. 사용자는 자신의 선호에 맞게 키캡을 선택할 수 있으며, 일부 키캡은 특별한 기능이나 디자인을 가지고 있습니다. ",
          "키캡은 키보드의 외관과 사용감을 결정하는 중요한 부분이며, 일부 사용자는 키캡을 변경하여 자신만의 개성을 표현하기도 합니다."
          ],
        "description2": [
          "키캡을 구매할 때 고려해야 할 사항은 다음과 같습니다.",
          "1. 호환성: 구매하려는 키캡이 자신이 사용하는 키보드와 호환되는지 확인해야 합니다. 일부 키캡은 특정 모델이나 브랜드의 키보드와만 호환되는 경우가 있으므로 주의가 필요합니다.",
          "2. 재질: 키캡의 재질은 타이핑 경험과 내구성에 영향을 미칩니다. ABS 플라스틱, PBT 플라스틱, POM 등 다양한 재질이 있으며, 각각의 특성을 고려하여 선택해야 합니다.",
          "3. 높이 및 프로필: 키캡의 높이와 프로필은 키보드의 타이핑 경험에 영향을 줍니다. 높이와 프로필이 사용자의 편안한 타이핑 자세와 일치하는지 확인해야 합니다.",
          "4. 색상과 디자인: 개인적인 취향에 맞는 색상과 디자인을 선택하는 것이 중요합니다. 키캡은 사용자의 개성을 표현할 수 있는 부분이기 때문에, 원하는 스타일과 느낌을 고려하여 선택해야 합니다.",
          "5. 가격: 키캡의 가격은 다양하며, 고품질의 재질과 디자인일수록 더 비실 수 있습니다. 자신의 예산과 용도에 맞는 적절한 키캡을 선택하는 것이 중요합니다."
          ],
        "image": "../img/3keycaps.jpg"
      }
    ]
  }